---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayBackground.ImageFlags
source: html/93a6d935-4329-0123-7081-15aac9e9c65c.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.ImageFlags Property

The image alignment indicators when the type is 'Image'.

## Syntax (C#)
```csharp
public ViewDisplayBackgroundImageFlags ImageFlags { get; }
```